app/controllers/rooms_controller.rb

SELECT COUNT(*) FROM "rooms" WHERE (number=NULL or size=NULL or location =NULL)
---
  def index
    @rooms = Room.all
    @rooms1 = Room.where('number=? or size=? or location =?',params[:number],params[:size],params[:location])

INSERT INTO "rooms" ("number", "size", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", "1"], ["size", "Small"], ["location", "D.H.Hill"], ["created_at", 2016-09-26 01:21:47 UTC], ["updated_at", 2016-09-26 01:21:47 UTC]]
---
  def create
    @room = Room.new(room_params)
    respond_to do |format|
      if @room.save